Repository: jucabrsp/info-hnews-ai-image
Catalog: languages/info-hnews-ai-image-*.po
Languages: pt_br

source: Active AI-Service: %s
pt_br: Serviço de IA Ativo: %s

source: AI-Prompt Settings
pt_br: Configurações de Prompt de IA

source: AI-Service
pt_br: Serviço de IA

source: Alternative AI-prompt:
pt_br: Prompt de IA alternativo:

source: API Key
pt_br: Chave da API

source: API key/token not configured for
pt_br: Chave de API/token não configurado para

source: API Settings
pt_br: Configurações da API

source: Choose a model. SDXL 1.0 is recommended for reliability.
pt_br: Escolha um modelo. SDXL 1.0 é recomendado para maior confiabilidade.

source: AI Image
pt_br: Imagem IA

source: Could not save image file:
pt_br: Não foi possível salvar o arquivo da imagem:

source: Could not generate a prompt from the post content. Please ensure the selected source (title, excerpt, or content) is not empty.
pt_br: Não foi possível gerar um prompt a partir do conteúdo do post. Por favor, garanta que a fonte selecionada (título, excerto ou conteúdo) não está vazia.

source: Donation
pt_br: Doação

source: Enter custom engine ID
pt_br: Digite um ID de motor personalizado

source: Enter manually (custom)
pt_br: Digitar manualmente (personalizado)

source: Generate
pt_br: Gerar

source: Generate image
pt_br: Gerar imagem

source: Generating image...
pt_br: Gerando imagem...

source: Height
pt_br: Altura

source: Image dimensions
pt_br: Dimensões da imagem

source: Image successfully generated!
pt_br: Imagem gerada com sucesso!

source: Image uploaded but could not be set as featured image.
pt_br: A imagem foi carregada, mas não foi possível defini-la como imagem destacada.

source: Insufficient permission.
pt_br: Permissões insuficientes.

source: Invalid AI service:
pt_br: Serviço de IA inválido:

source: Leave empty to use the auto-prompt source.
pt_br: Deixe em branco para usar a fonte de prompt automático.

source: Model ID
pt_br: ID do Modelo

source: Model Identifier
pt_br: Identificador do Modelo

source: Negative AI-prompt (optional):
pt_br: Prompt de IA negativo (opcional):

source: Page - or Post content
pt_br: Conteúdo da página ou do post

source: Page - or Post title
pt_br: Título da página ou do post

source: Paste your Access Token from Hugging Face here.
pt_br: Cole o seu Token de Acesso do Hugging Face aqui.

source: Plugin settings not found.
pt_br: Configurações do plugin não encontradas.

source: Recommended size for SDXL is 1024x1024.
pt_br: O tamanho recomendado para SDXL é 1024x1024.

source: Security check failed.
pt_br: A verificação de segurança falhou.

source: Settings
pt_br: Configurações

source: Source for auto-prompt
pt_br: Fonte para prompt automático

source: Source for auto-prompt: %s
pt_br: Fonte para prompt automático: %s

source: What to avoid in the image?
pt_br: O que evitar na imagem?

source: Width
pt_br: Largura

source: Width/height must be in increments of 64. Total pixels cannot exceed 1,048,576.
pt_br: A largura/altura deve ser em incrementos de 64. O total de píxeis não pode exceder 1.048.576.

source: Access Token
pt_br: Token de Acesso

source: Default Image Style
pt_br: Estilo de Imagem Padrão

source: Engine ID
pt_br: ID do Motor

source: SDXL 1.0 is a stable and powerful option.
pt_br: SDXL 1.0 é uma opção estável e poderosa.

source: Stable Diffusion XL 1.0 (Recommended)
pt_br: Stable Diffusion XL 1.0 (Recomendado)

source: Visit plugin site
pt_br: Visitar site do plugin

source: Excerpt (preferred)
pt_br: Excerto (preferencial)

source: Hugging Face (Requires Token)
pt_br: Hugging Face (Requer Token)

source: Pollinations.ai (Free)
pt_br: Pollinations.ai (Grátis)

source: Get AI MAX Pro Version, discover all the EXCLUSIVE features and get 15% off at checkout using Coupon: MAX15
pt_br: Obtenha a Versão Pro do AI MAX, descubra todos os recursos EXCLUSIVOS e ganhe 15% de desconto no checkout usando o Cupom: MAX15

source: CHECK NOW !
pt_br: CONFIRA AGORA !

source: Invalid or non-existent post ID.
pt_br: ID de post inválido ou inexistente.

source: An error occurred during image generation.
pt_br: Ocorreu um erro durante a geração da imagem.

source: Please enter your API key for %s in the plugin settings.
pt_br: Por favor, insira sua chave de API para %s nas configurações do plugin.

source: e.g. text, blurry, watermark
pt_br: ex: texto, borrado, marca d'água

source: Width:
pt_br: Largura:

source: Height:
pt_br: Altura:

source: Ultra-Realistic Photo Style
pt_br: Estilo Foto Ultrarrealista

source: Realistic Drawing Style
pt_br: Estilo Desenho Realista

source: Simple Drawing Style
pt_br: Estilo Desenho Simples

source: Error:
pt_br: Erro:

source: Unknown Error.
pt_br: Erro desconhecido.

source: AJAX Error:
pt_br: Erro AJAX:

source: Failed:
pt_br: Falhou:
